docs/produkte/dat-uropa-code-fah/request-getveh-15115.md

---
title: "Request getVehicleIdentificationByTypecode"
topic_id: "15115"
breadcrumb: "SilverDAT Produkte > DAT €uropa-Code® Fahrzeugauswahl > Fahrzeugidentifikation - Funktionen > Fahrzeugidentifikation anhand Typcode > Request getVehicleIdentificationByTypecode"
---

# Request getVehicleIdentificationByTypecode

```
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:veh="http://sphinx.dat.de/services/VehicleIdentificationService">
  <soapenv:Header/>
  <soapenv:Body>
    <veh:getVehicleIdentificationByTypecode>
      <request>
        <locale country="DE" datCountryIndicator="DE" language="DE"/>
        <sessionID></sessionID>
        <restriction>APPRAISAL</restriction>
        <coverage>ALL</coverage>
        <manufacturerKey>800</manufacturerKey>
        <typeCode>1Z5254</typeCode>
        <productionDate>2006-03-02</productionDate>
        <equipmentCodes>QG1</equipmentCodes>
        <equipmentCodes>A8C</equipmentCodes>
        <equipmentCodes>9JD</equipmentCodes>
        <equipmentCodes>0A2</equipmentCodes>
        <equipmentCodes>1B</equipmentCodes>
        <equipmentCodes>6XN</equipmentCodes>
        <equipmentCodes>5RQ</equipmentCodes>
        <equipmentCodes>6FB</equipmentCodes>
        <equipmentCodes>3S2</equipmentCodes>
        <equipmentCodes>PG0</equipmentCodes>
        <equipmentCodes>8Q1</equipmentCodes>
        <equipmentCodes>7R6</equipmentCodes>
        <equipmentCodes>8WB</equipmentCodes>
        <equipmentCodes>8TC</equipmentCodes>
        <equipmentCodes>8M1</equipmentCodes>
        <equipmentCodes>A8C</equipmentCodes>
        <equipmentCodes>4B1</equipmentCodes>
        <equipmentCodes>4GF</equipmentCodes>
        <equipmentCodes>4KC</equipmentCodes>
        <equipmentCodes>8RM</equipmentCodes>
        <equipmentCodes>9Q1</equipmentCodes>
        <equipmentCodes>9Y1</equipmentCodes>
        <equipmentCodes>7X1</equipmentCodes>
        <equipmentCodes>4N1</equipmentCodes>
        <equipmentCodes>4UF</equipmentCodes>
        <equipmentCodes>4X3</equipmentCodes>
        <equipmentCodes>4UF</equipmentCodes>
        <equipmentCodes>3NW</equipmentCodes>
        <equipmentCodes>9JD</equipmentCodes>
        <equipmentCodes>9AP</equipmentCodes>
        <equipmentCodes>4A3</equipmentCodes>
        <equipmentCodes>PW0</equipmentCodes>
        <equipmentCodes>3L3</equipmentCodes>
        <equipmentCodes>3NW</equipmentCodes>
        <equipmentCodes>3J7</equipmentCodes>
        <equipmentCodes>3Q6</equipmentCodes>
        <equipmentCodes>4K3</equipmentCodes>
        <equipmentCodes>2W3</equipmentCodes>
        <equipmentCodes>3QT</equipmentCodes>
        <equipmentCodes>3C7</equipmentCodes>
        <equipmentCodes>9P1</equipmentCodes>
        <equipmentCodes>3QT</equipmentCodes>
        <equipmentCodes>9TB</equipmentCodes>
        <equipmentCodes>9GG</equipmentCodes>
        <equipmentCodes>PDB</equipmentCodes>
        <equipmentCodes>7AL</equipmentCodes>
        <equipmentCodes>8Y1</equipmentCodes>
        <equipmentCodes>7B2</equipmentCodes>
        <equipmentCodes>9WR</equipmentCodes>
        <equipmentCodes>3B4</equipmentCodes>
        <equipmentCodes>QN2</equipmentCodes>
        <equipmentCodes>1W2</equipmentCodes>
        <equipmentCodes>1KD</equipmentCodes>
        <equipmentCodes>1ZF</equipmentCodes>
        <equipmentCodes>1KD</equipmentCodes>
        <equipmentCodes>9U1</equipmentCodes>
        <equipmentCodes>C8V</equipmentCodes>
        <equipmentCodes>H7F</equipmentCodes>
        <equipmentCodes>1G2</equipmentCodes>
        <equipmentCodes>1N3</equipmentCodes>
        <equipmentCodes>1AT</equipmentCodes>
        <equipmentCodes>1X0</equipmentCodes>
        <equipmentCodes>J0N</equipmentCodes>
        <equipmentCodes>8GU</equipmentCodes>
        <equipmentCodes>G0C</equipmentCodes>
        <equipmentCodes>7GG</equipmentCodes>
        <equipmentCodes>8Z5</equipmentCodes>
        <equipmentCodes>BLS</equipmentCodes>
        <equipmentCodes>X0A</equipmentCodes>
        <equipmentCodes>6E3</equipmentCodes>
        <equipmentCodes>7E6</equipmentCodes>
        <colorCode>A1|1B|Diamant-Silber Metallic</colorCode>
        <colorCode>A2|1B|Diamant-Silber Metallic</colorCode>
        <colorCode>I1|BK|Graham Onyx / Onyx-Onyx / Schwarz</colorCode>
        <colorCode>PF||Graham Onyx</colorCode>
        <colorCode>PM||Sitzbezüge in Stoff</colorCode>
      </request>
    </veh:getVehicleIdentificationByTypecode>
  </soapenv:Body>
</soapenv:Envelope>
```
