docs/produkte/dat-uropa-code-fah/request-getvin-2010.md

---
title: "Request getVinByLicencePlateItaly"
topic_id: "2010"
breadcrumb: "SilverDAT Produkte > DAT €uropa-Code® Fahrzeugauswahl > Fahrzeugidentifikation - Funktionen > Fahrzeugidentifikation Italien - anhand Kennzeichenabfrage > Request getVinByLicencePlateItaly"
---

# Request getVinByLicencePlateItaly

```
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:veh="http://sphinx.dat.de/services/VehicleIdentificationService">
   <soapenv:Header/>
   <soapenv:Body>
      <veh:getVinByLicencePlateItaly>
         <request>
            <licencePlate>BX58XXX</licencePlate>
         </request>
      </veh:getVinByLicencePlateItaly >
   </soapenv:Body>
</soapenv:Envelope>
```
